uhnp/src/Catalogs/ЭтапыПодготовкиБюджетов/ЭтапыПодготовкиБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыПодготовкиБюджетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.МоделиБюджетирования</owners>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>130</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеРасписания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ТипыДействийЭтаповПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиКонтрольныхОтчетов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаДействия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНастройкиДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДлительности</name>
    <type>
      <types>EnumRef.ТипыСроковЭтаповПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДлительности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВыполненияЭтапов</name>
    <type>
      <types>EnumRef.ПорядокВыполненияЭтаповПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеЗапуска</name>
    <type>
      <types>EnumRef.ТипыУсловийЗапускаЭтаповПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Срок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрока</name>
    <type>
      <types>EnumRef.ТипыСроковЭтаповПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыполняется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Enums/ТипыДействийЭтаповПодготовкиБюджетов/ТипыДействийЭтаповПодготовкиБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДействийЭтаповПодготовкиБюджетов</name>
  <enumValues>
    <name>ВводБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ВводПлана</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЗначенийНефинансовыхПоказателей</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ПовторГруппыЭтапов</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЛимитовРасходаДС</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаИсправлениеБюджетов</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ЭтапыПодготовкиБюджетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура меняет коды переданного элемента и ближайшего элемента
// в указанном направлении.
//
// Параметры:
//  Элемент  - СправочникСсылка.ЭтапыПодготовкиБюджетов - Элемент, у которого меняем код.
//  Направление  - Число - В какую сторону меняем код (+1, -1).
//
Процедура СдвинутьЭлемент(Элемент, Направление) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЭтапыПодготовкиБюджетов.Ссылка,
	|	ЭтапыПодготовкиБюджетов.Родитель,
	|	ЭтапыПодготовкиБюджетов.Код + &Смещение КАК Код,
	|	ЭтапыПодготовкиБюджетов.Владелец
	|ПОМЕСТИТЬ ТекущийЭлемент
	|ИЗ
	|	Справочник.ЭтапыПодготовкиБюджетов КАК ЭтапыПодготовкиБюджетов
	|ГДЕ
	|	ЭтапыПодготовкиБюджетов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыПодготовкиБюджетов.Ссылка,
	|	ВЫБОР
	|		КОГДА ЭтапыПодготовкиБюджетов.Ссылка = ТекущийЭлемент.Ссылка
	|			ТОГДА ТекущийЭлемент.Код
	|		ИНАЧЕ ЭтапыПодготовкиБюджетов.Код
	|	КОНЕЦ КАК КодПорядок,
	|	ВЫБОР
	|		КОГДА ЭтапыПодготовкиБюджетов.Ссылка = ТекущийЭлемент.Ссылка
	|			ТОГДА &Смещение
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДопПорядок,
	|	ЭтапыПодготовкиБюджетов.Код
	|ИЗ
	|	ТекущийЭлемент КАК ТекущийЭлемент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПодготовкиБюджетов КАК ЭтапыПодготовкиБюджетов
	|		ПО ТекущийЭлемент.Родитель = ЭтапыПодготовкиБюджетов.Родитель
	|			И ТекущийЭлемент.Владелец = ЭтапыПодготовкиБюджетов.Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодПорядок,
	|	ДопПорядок");
	
	Запрос.УстановитьПараметр("Ссылка", Элемент);
	Запрос.УстановитьПараметр("Смещение", Направление);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Сч = 0;
	Пока Выборка.Следующий() Цикл
		Сч = Сч + 1;
		Если Сч <> Выборка.Код Тогда
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Код = Сч;
			Объект.мРежимОбновленияКода = Истина;
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура перенумеровывает всю группу элементов
// применяется при переносе элемента в новую группу - перенумеровывается старая группа.
//
// Параметры:
//  Родитель  - СправочникСсылка.ЭтапыПодготовкиБюджетов - Группа, в рамках которой следует перенумеровать.
//  ПереносимыйЭлемент  - СправочникСсылка.ЭтапыПодготовкиБюджетов - Элемент, который переносим из группы.
//
Процедура ПеренумероватьГруппуЭлементов(Родитель, ПереносимыйЭлемент) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЭтапыПодготовкиБюджетов.Ссылка,
	|	ЭтапыПодготовкиБюджетов.Код
	|ИЗ
	|	Справочник.ЭтапыПодготовкиБюджетов КАК ЭтапыПодготовкиБюджетов
	|ГДЕ
	|	ЭтапыПодготовкиБюджетов.Родитель = &Родитель
	|	И ЭтапыПодготовкиБюджетов.Ссылка <> &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыПодготовкиБюджетов.Код");
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.УстановитьПараметр("Ссылка", ПереносимыйЭлемент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Сч = 0;
	Пока Выборка.Следующий() Цикл
		Сч = Сч + 1;
		Если Сч <> Выборка.Код Тогда
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Код = Сч;
			Объект.мРежимОбновленияКода = Истина;
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП.
// 
// Возвращаемое значение:
// 	Массив из Строка - имена блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Периодичность");
	Результат.Добавить("ПорядокВыполненияЭтапов");
	
	Возврат Результат;
	
КонецФункции

// Приводит типы аналитик статей бюджетов в настройках действия к метаданным текущей конфигурации
//
Процедура ОбновитьНастройкиДействия() Экспорт
	
	Выборка = Справочники.ЭтапыПодготовкиБюджетов.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ЭтоГруппа Тогда
			
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			НастройкаДействия = СправочникОбъект.НастройкаДействия.Получить();
			
			Если НастройкаДействия <> Неопределено И ТипЗнч(НастройкаДействия) = Тип("ТаблицаЗначений") Тогда
				Если НастройкаДействия.Колонки.Найти("Имя") <> Неопределено
					И НастройкаДействия.Колонки.Найти("Значение") <> Неопределено Тогда
					
					Для каждого СтрокаТаблицы1 Из НастройкаДействия Цикл
						Если СтрокаТаблицы1.Имя = "АналитикаЗаполненияБюджета" Тогда
							
							Таблица = СтрокаТаблицы1.Значение;
							КопияТаблицы = Таблица.СкопироватьКолонки();
							
							Для инд = 1 по 6 Цикл
								КолонкаАналитики = КопияТаблицы.Колонки.Найти("Аналитика" + Строка(инд));
								Если КолонкаАналитики <> Неопределено Тогда
									КопияТаблицы.Колонки.Удалить(КолонкаАналитики);
									КопияТаблицы.Колонки.Добавить("Аналитика" + Строка(инд),
										Метаданные.ПланыВидовХарактеристик.АналитикиСтатейБюджетов.Тип);
								КонецЕсли;
							КонецЦикла;
							
							Для каждого СтрокаТаблицы2 Из Таблица Цикл
								ЗаполнитьЗначенияСвойств(КопияТаблицы.Добавить(), СтрокаТаблицы2);
							КонецЦикла;
							
							СтрокаТаблицы1.Значение = КопияТаблицы;
						Иначе
							Продолжить;
						КонецЕсли;
					КонецЦикла;
					
					СправочникОбъект.НастройкаДействия = Новый ХранилищеЗначения(НастройкаДействия);
					СправочникОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ЭтапыПодготовкиБюджетов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.21.62";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a2cd2d9c-ee2f-44b2-a5a4-69db33bc857e");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.ЭтапыПодготовкиБюджетов.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Добавляет колонку ""Действие"" в таблицу ""Виды бюджетов"", хранящуюся в реквизите ""Настройка действия"".';
									|en = 'Adds the ""Action"" column to the ""Budget profiles"" table stored in the ""Action setting"" attribute.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Справочники.ЭтапыПодготовкиБюджетов.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Справочники.ЭтапыПодготовкиБюджетов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Справочники.ЭтапыПодготовкиБюджетов.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

КонецПроцедуры

// Описание
// 
// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры = Неопределено) Экспорт
	
	ИмяОбъектаМетаданных = Метаданные.Справочники.ЭтапыПодготовкиБюджетов.ПолноеИмя();
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ИмяОбъектаМетаданных;
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЭтапыПодготовкиБюджетов.Ссылка КАК Ссылка,
	|	ЭтапыПодготовкиБюджетов.НастройкаДействия КАК НастройкаДействия
	|ИЗ
	|	Справочник.ЭтапыПодготовкиБюджетов КАК ЭтапыПодготовкиБюджетов
	|ГДЕ
	|	ЭтапыПодготовкиБюджетов.Действие = ЗНАЧЕНИЕ(Перечисление.ТипыДействийЭтаповПодготовкиБюджетов.ВводБюджетов)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Результат = Запрос.Выполнить();
	
	ТаблицаРезультат = Результат.Выгрузить();
	СсылкиКОбработке = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		НастройкаДействия = СтрокаТаблицы.НастройкаДействия.Получить();
		Если ТипЗнч(НастройкаДействия) = Тип("ТаблицаЗначений") Тогда
			СтрокаВидыБюджетов = НастройкаДействия.Найти("ВидыБюджетов", "Имя");
			Если СтрокаВидыБюджетов = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ТаблицаВидыБюджетов = СтрокаВидыБюджетов.Значение; // -ТаблицаЗначений-
			Если ТаблицаВидыБюджетов.Колонки.Найти("Действие") = Неопределено Тогда
				СсылкиКОбработке.Добавить(СтрокаТаблицы.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, СсылкиКОбработке);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.Справочники.ЭтапыПодготовкиБюджетов;
	ИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ИмяОбъектаМетаданных);
		Возврат;
	КонецЕсли;
	
	Для Каждого Выборка Из ОбновляемыеДанные Цикл
		НачатьТранзакцию();
		
		Попытка
			
			Этап = Выборка.Ссылка; // СправочникСсылка.ЭтапыПодготовкиБюджетов - 
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ИмяОбъектаМетаданных);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Этап);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ЭтапОбъект = Этап.ПолучитьОбъект();
			НастройкаДействия = ЭтапОбъект.НастройкаДействия.Получить();
			СтрокаВидыБюджетов = НастройкаДействия.Найти("ВидыБюджетов", "Имя");
			Если СтрокаВидыБюджетов = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ТаблицаВидыБюджетов = СтрокаВидыБюджетов.Значение; // - ТаблицаЗначений -
			Если ТаблицаВидыБюджетов.Колонки.Найти("Действие") = Неопределено Тогда
				ТаблицаВидыБюджетов.Колонки.Добавить("Действие",
					Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДействийЭкземпляровБюджетов"));
				ЭтапОбъект.НастройкаДействия = Новый ХранилищеЗначения(НастройкаДействия);
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭтапОбъект);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			Шаблон = НСтр("ru = 'Не удалось записать этап подготовки бюджетов %1 по причине: %2';
							|en = 'Cannot save the ""%1"" due to ""%2""'");
			
			ТекстСообщения = 	СтрШаблон(
				Шаблон,
				Этап,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				ОбъектМетаданных,,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ИмяОбъектаМетаданных);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
